modern_dev_tools/lab3/src/Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментацрий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчетное</Name>
							<Comment> Учетное количество товара по данным системы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФактическое</Name>
							<Comment>Фактическое количество товара на складе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

modern_dev_tools/lab3/src/Documents/Инвентаризация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыНаИнвентаризациюКоличествоФактическоеПриИзменении(Элемент)
	
	// Получаем строку, в которой пользователь изменил данные
	СтрокаТЧ = Элементы.ТоварыНаИнвентаризацию.ТекущиеДанные;
	
	 Если СтрокаТЧ <> Неопределено Тогда
		// Рассчитываем разницу по формуле: Фактическое - Учетное
		СтрокаТЧ.Разница = СтрокаТЧ.КоличествоФактическое - СтрокаТЧ.КоличествоУчетное;
	 КонецЕсли;
	
 КонецПроцедуры

&НаКлиенте
 Процедура ТоварыКоличествоУчетноеПриИзменении(Элемент)
	 // Вставить содержимое обработчика.
 КонецПроцедуры
 
 
 &НаКлиенте
Процедура ТоварыНаИнвентаризациюКоличествоУчетноеПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ТоварыНаИнвентаризацию.ТекущиеДанные;
	
	Если СтрокаТЧ <> Неопределено Тогда
		СтрокаТЧ.Разница = СтрокаТЧ.КоличествоФактическое - СтрокаТЧ.КоличествоУчетное;
	КонецЕсли;
	
КонецПроцедуры
